12/data/attachments/8f6ca60c69b4f564.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_db3e76ae-7435-480c-8a61-666475832b79</nif:username>
            <nif:friendToBeAdded>Michael_red_Friend_59960_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>